'''
💡 부족한 핵심 아이디어시작 숫자 결정: 
문자열의 첫 1~3글자가 시작 숫자($A$)가 될 수 있습니다. (문제 조건상 $A$는 1~999)
직접 문자열 만들기: 시작 숫자 $A$를 정했다면, 거기서부터 1씩 더해가며 원래 문자열과 길이가 같아질 때까지 새로운 문자열을 직접 만들어봅니다.
전체 비교: 내가 만든 문자열이 입력받은 nums와 완전히 일치하는지 확인합니다. 일치한다면 그때의 시작값과 마지막값이 정답입니다.
'''

nums = input()
for i in range(1,4):
    if i > len(nums): break
    
    start_num = int(nums[:i])
    current_str = ""
    temp_num = start_num
    while len(current_str) < len(nums):
        current_str += str(temp_num)
        if current_str == nums:
            print(f'{start_num} {temp_num}')
            exit()
        temp_num += 1

